---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Schema.Dispose
source: html/4b3e5a04-9723-1121-3be5-fd0e8bab390c.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.Dispose Method

Releases all resources used by the Schema

## Syntax (C#)
```csharp
public void Dispose()
```